FemDesign.Releases.Motions.ValueRigidPoint
Rigid translation/rotation stiffness value for point support. [kN/m or kNm/rad]

FemDesign.Releases.Motions.ValueRigidLine
Rigid translation/rotation stiffness value for line support. [kN/m/m or kNm/m/rad]

FemDesign.Releases.Motions.#ctor
Parameterless constructor for serialization.

FemDesign.Releases.Motions.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Private constructor [kN/m or kN/m/m].
xNeg: Kx' compression.
xPos: Kx' tension.
yNeg: Ky' compression.
yPos: Ky' tension.
zNeg: Kz' compression.
zPos: Kz' tension.

FemDesign.Releases.Motions.Define(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Define a new translations release [kN/m or kN/m/m].
xNeg: Kx' compression [kN/m or kN/m/m].
xPos: Kx' tension [kN/m or kN/m/m].
yNeg: Ky' compression [kN/m or kN/m/m].
yPos: Ky' tension [kN/m or kN/m/m].
zNeg: Kz' compression [kN/m or kN/m/m].
zPos: Kz' tension [kN/m or kN/m/m].

FemDesign.Releases.Motions.RigidPoint
Define a rigid translation release for a point-type release (1.000e+10)

FemDesign.Releases.Motions.RigidLine
/// Define a rigid translation release for a line-type release (1.000e+7)

FemDesign.Releases.Motions.Free
Define a free translation release.